import { CommentCard } from '../comment-card/comment-card';
import { Stack } from '@servicetitan/design-system';

export const BookReviews = () => {
    return (
        <Stack className="p-y-3" direction="column">
            <CommentCard
                deletable
                id={0}
                name="Անուն ազգանուն"
                onDelete={_id => {}}
                review="Նոր դիստոպիան ապագայի մասին է, որտեղ երեխաներին սովորեցնում են արհեստական ընկեր կոչվող ռոբոտները: Վեպի գլխավոր հերոսուհին՝ Կլարան, հենց այդպիսի ռոբոտ է, և չնայած նրա գիտելիքները հսկայական են, նա շատ քիչ բան գիտի իրեն շրջապատող աշխարհի մասին, և նրա կյանքը ամբողջովին կախված է նրանից, թե ով է նրան գնում:"
                createdOn="12/22/22"
            />
            <CommentCard
                deletable
                id={0}
                name="Անուն ազգանուն"
                onDelete={_id => {}}
                review="Նոր դիստոպիան ապագայի մասին է, որտեղ երեխաներին սովորեցնում են արհեստական ընկեր կոչվող ռոբոտները: Վեպի գլխավոր հերոսուհին՝ Կլարան, հենց այդպիսի ռոբոտ է, և չնայած նրա գիտելիքները հսկայական են, նա շատ քիչ բան գիտի իրեն շրջապատող աշխարհի մասին, և նրա կյանքը ամբողջովին կախված է նրանից, թե ով է նրան գնում:"
                createdOn="12/22/22"
            />
            <CommentCard
                deletable
                id={0}
                name="Անուն ազգանուն"
                onDelete={_id => {}}
                review="Նոր դիստոպիան ապագայի մասին է, որտեղ երեխաներին սովորեցնում են արհեստական ընկեր կոչվող ռոբոտները: Վեպի գլխավոր հերոսուհին՝ Կլարան, հենց այդպիսի ռոբոտ է, և չնայած նրա գիտելիքները հսկայական են, նա շատ քիչ բան գիտի իրեն շրջապատող աշխարհի մասին, և նրա կյանքը ամբողջովին կախված է նրանից, թե ով է նրան գնում:"
                createdOn="12/22/22"
            />
            <CommentCard
                deletable
                id={0}
                name="Անուն ազգանուն"
                onDelete={_id => {}}
                review="Նոր դիստոպիան ապագայի մասին է, որտեղ երեխաներին սովորեցնում են արհեստական ընկեր կոչվող ռոբոտները: Վեպի գլխավոր հերոսուհին՝ Կլարան, հենց այդպիսի ռոբոտ է, և չնայած նրա գիտելիքները հսկայական են, նա շատ քիչ բան գիտի իրեն շրջապատող աշխարհի մասին, և նրա կյանքը ամբողջովին կախված է նրանից, թե ով է նրան գնում:"
                createdOn="12/22/22"
            />
            <CommentCard
                deletable
                id={0}
                name="Անուն ազգանուն"
                onDelete={_id => {}}
                review="Նոր դիստոպիան ապագայի մասին է, որտեղ երեխաներին սովորեցնում են արհեստական ընկեր կոչվող ռոբոտները: Վեպի գլխավոր հերոսուհին՝ Կլարան, հենց այդպիսի ռոբոտ է, և չնայած նրա գիտելիքները հսկայական են, նա շատ քիչ բան գիտի իրեն շրջապատող աշխարհի մասին, և նրա կյանքը ամբողջովին կախված է նրանից, թե ով է նրան գնում:"
                createdOn="12/22/22"
            />
            <CommentCard
                deletable
                id={0}
                name="Անուն ազգանուն"
                onDelete={_id => {}}
                review="Նոր դիստոպիան ապագայի մասին է, որտեղ երեխաներին սովորեցնում են արհեստական ընկեր կոչվող ռոբոտները: Վեպի գլխավոր հերոսուհին՝ Կլարան, հենց այդպիսի ռոբոտ է, և չնայած նրա գիտելիքները հսկայական են, նա շատ քիչ բան գիտի իրեն շրջապատող աշխարհի մասին, և նրա կյանքը ամբողջովին կախված է նրանից, թե ով է նրան գնում:"
                createdOn="12/22/22"
            />
            <CommentCard
                deletable
                id={0}
                name="Անուն ազգանուն"
                onDelete={_id => {}}
                review="Նոր դիստոպիան ապագայի մասին է, որտեղ երեխաներին սովորեցնում են արհեստական ընկեր կոչվող ռոբոտները: Վեպի գլխավոր հերոսուհին՝ Կլարան, հենց այդպիսի ռոբոտ է, և չնայած նրա գիտելիքները հսկայական են, նա շատ քիչ բան գիտի իրեն շրջապատող աշխարհի մասին, և նրա կյանքը ամբողջովին կախված է նրանից, թե ով է նրան գնում:"
                createdOn="12/22/22"
            />
            <CommentCard
                deletable
                id={0}
                name="Անուն ազգանուն"
                onDelete={_id => {}}
                review="Նոր դիստոպիան ապագայի մասին է, որտեղ երեխաներին սովորեցնում են արհեստական ընկեր կոչվող ռոբոտները: Վեպի գլխավոր հերոսուհին՝ Կլարան, հենց այդպիսի ռոբոտ է, և չնայած նրա գիտելիքները հսկայական են, նա շատ քիչ բան գիտի իրեն շրջապատող աշխարհի մասին, և նրա կյանքը ամբողջովին կախված է նրանից, թե ով է նրան գնում:"
                createdOn="12/22/22"
            />
        </Stack>
    );
};
